Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1 (Conv2D)               (None, 26, 26, 4)         40        
_________________________________________________________________
pool1 (MaxPooling2D)         (None, 13, 13, 4)         0         
_________________________________________________________________
conv2 (Conv2D)               (None, 11, 11, 8)         296       
_________________________________________________________________
pool2 (MaxPooling2D)         (None, 5, 5, 8)           0         
_________________________________________________________________
dropout (Dropout)            (None, 5, 5, 8)           0         
_________________________________________________________________
flatten (Flatten)            (None, 200)               0         
_________________________________________________________________
dense (Dense)                (None, 10)                2010      
=================================================================
Total params: 2,346
Trainable params: 2,346
Non-trainable params: 0
_________________________________________________________________